#pragma once
#include "PieceObject.h"

class Pawn_Normal :
	public PieceObject
{
	/*********************************************************
	* @brief	gameobject interface override
	********************************************************/
public:
	Pawn_Normal();
	void UpdateGameObject()override;

	/*********************************************************
	* @brief	コンポネント
	********************************************************/

	/*********************************************************
	* @brief	customize
	********************************************************/
};

